<?

$arr_t = array ( 'wc2006', 'euro2008' );

if ( !isset ( $ent ) || !in_array( $ent, $arr_t ) )
{
	header( "Location: /" );
}
if ( $ent == 'wc2006' )
{
	$title = 'Чемпионат мира 2006';
	$file_res 		= './files/results_wc2006.txt';
	$file_real_res  = './files/real_results_wc2006.txt';
	$file_graph 	= './files/for_graph_wc2006.txt';
	
	$MatchNames = unserialize( 'a:48:{i:1;s:22:"Германия -- Коста-Рика";i:2;s:17:"Польша -- Эквадор";i:17;s:18:"Германия -- Польша";i:18;s:21:"Эквадор -- Коста-Рика";i:33;s:19:"Эквадор -- Германия";i:34;s:20:"Коста-Рика -- Польша";i:3;s:18:"Англия -- Парагвай";i:4;s:27:"Тринидад и Тобаго -- Швеция";i:19;s:27:"Англия -- Тринидад и Тобаго";i:20;s:18:"Швеция -- Парагвай";i:35;s:16:"Швеция -- Англия";i:36;s:29:"Парагвай -- Тринидад и Тобаго";i:5;s:24:"Аргентина -- Кот-д\'Ивуар";i:6;s:32:"Сербия и Черногория -- Голландия";i:21;s:32:"Аргентина -- Сербия и Черногория";i:22;s:24:"Голландия -- Кот-д\'Ивуар";i:37;s:22:"Голландия -- Аргентина";i:38;s:34:"Кот-д\'Ивуар -- Сербия и Черногория";i:7;s:15:"Мексика -- Иран";i:8;s:20:"Ангола -- Португалия";i:23;s:17:"Мексика -- Ангола";i:24;s:18:"Португалия -- Иран";i:39;s:21:"Португалия -- Мексика";i:40;s:14:"Иран -- Ангола";i:9;s:14:"Италия -- Гана";i:10;s:12:"США -- Чехия";i:25;s:13:"Италия -- США";i:26;s:13:"Чехия -- Гана";i:41;s:15:"Чехия -- Италия";i:42;s:11:"Гана -- США";i:11;s:20:"Бразилия -- Хорватия";i:12;s:19:"Австралия -- Япония";i:27;s:21:"Бразилия -- Австралия";i:28;s:18:"Япония -- Хорватия";i:43;s:18:"Япония -- Бразилия";i:44;s:21:"Хорватия -- Австралия";i:13;s:20:"Франция -- Швейцария";i:14;s:13:"Корея -- Того";i:29;s:16:"Франция -- Корея";i:30;s:17:"Того -- Швейцария";i:45;s:15:"Того -- Франция";i:46;s:18:"Швейцария -- Корея";i:15;s:18:"Испания -- Украина";i:16;s:26:"Тунис -- Саудовская Аравия";i:31;s:16:"Испания -- Тунис";i:32;s:28:"Саудовская Аравия -- Украина";i:47;s:28:"Саудовская Аравия -- Испания";i:48;s:16:"Украина -- Тунис";}' );
	
	$UserList = array();
	$UserList['serg'] 		= 'Сергей';
	$UserList['alex'] 		= 'Алексей';
	$UserList['alena'] 		= 'Алена';
	$UserList['father'] 	= 'Папа';
	
	$ColorList = array();
	$ColorList['serg'] 		= 'blue';
	$ColorList['alex'] 		= 'green';
	$ColorList['alena'] 	= 'yellow';
	$ColorList['father'] 	= 'red';
	
	$secret_pass = 'preved';
	
	$result_sum 	= 200;
	$diff_score_sum = 140;
	$ishod_sum 		= 80;
	
}

else if ( $ent == 'euro2008' )
{
	$title = 'Чемпионат Европы 2008';
	
	$MatchNames = unserialize( 'a:24:{i:1;s:18:"Швейцария -- Чехия";i:2;s:20:"Португалия -- Турция";i:3;s:19:"Австрия -- Хорватия";i:4;s:18:"Германия -- Польша";i:5;s:18:"Румыния -- Франция";i:6;s:20:"Нидерланды -- Италия";i:7;s:17:"Испания -- Россия";i:8;s:16:"Греция -- Швеция";i:9;s:19:"Чехия -- Португалия";i:10;s:19:"Швейцария -- Турция";i:11;s:20:"Хорватия -- Германия";i:12;s:17:"Австрия -- Польша";i:13;s:17:"Италия -- Румыния";i:14;s:21:"Нидерланды -- Франция";i:15;s:17:"Швеция -- Испания";i:16;s:16:"Греция -- Россия";i:17;s:23:"Швейцария -- Португалия";i:18;s:15:"Турция -- Чехия";i:19;s:18:"Польша -- Хорватия";i:20;s:19:"Австрия -- Германия";i:21;s:21:"Нидерланды -- Румыния";i:22;s:17:"Франция -- Италия";i:23;s:17:"Греция -- Испания";i:24;s:16:"Россия -- Швеция";}' );
	
	$file_res 		= './files/results_euro2008.txt';
	$file_real_res  = './files/real_results_euro2008.txt';
	$file_graph 	= './files/for_graph_euro2008.txt';
	
	$UserList = array();
	$UserList['serg'] 	 = 'Сергей';
	$UserList['alex']	 = 'Алексей';
	$UserList['vladimir'] = 'Владимир';
	$UserList['father']  = 'Папа';
	
	$ColorList = array();
	$ColorList['serg'] 		= 'blue';
	$ColorList['alex'] 		= 'green';
	$ColorList['vladimir']  = 'yellow';
	$ColorList['father'] 	= 'red';
	
	$secret_pass = 'preved';
	
	$result_sum 	= 300;
	$diff_score_sum = 200;
	$ishod_sum 		= 100;
	
}